app/views/gadgets/_form.html.haml

              .col-md-7{:style => "padding-top:13px"}
                - AnalysisGroup.all.each do |a_value|
---
SELECT `analysis_groups`.* FROM `analysis_groups`

                .col-md-7{:style => "padding-top:13px"}
                  - TypeOfMethod.all.each do |a_value|
---
SELECT `type_of_methods`.* FROM `type_of_methods`

                    .col-md-3
                      = gadget.select :currencys_id, Currency.all.collect {|p| [ p.name, p.id] },{:default => 'Guest'}, {:class => 'form-control', id: 'currency_select'}
---
SELECT `currencies`.* FROM `currencies`

                                .col-md-7{:style => "padding-top:13px"}
                                  - QualifyAreaOfInterest.all.each do |a_value|
---
SELECT `qualify_area_of_interests`.* FROM `qualify_area_of_interests`