app/controllers/contacts_controller.rb

INSERT INTO `contacts` (`contact_mail`, `contact_message`, `contact_name`, `created_at`, `updated_at`) VALUES ('', '', '', '2014-08-04 13:39:06', '2014-08-04 13:39:06')
---
  def create
    #render :text => "index" and return
    @contacts = Contact.new
    #render :text => params.inspect and return
    @contacts.contact_name = params[:contact][:contact_name]
    @contacts.contact_mail = params[:contact][:contact_mail]
    @contacts.contact_message = params[:contact][:contact_message]
    #render :text => params.inspect and return
    if @contacts.save